app/controllers/licenca_controller.rb

  def validate

    begin
      @licenca = Licenca.find(params[:code])


      if params[:mode] == '1' #NOVA INSTALAÇÃO

        if @licenca.instalacoes == nil
          @licenca.instalacoes = 1
        else
          @licenca.instalacoes = @licenca.instalacoes + 1
        end

        @licenca.save!
---
SELECT  "licencas".* FROM "licencas"  WHERE "licencas"."id" = $1 LIMIT 1  [["id", 8147041756]]
UPDATE "licencas" SET "instalacoes" = $1, "updated_at" = $2 WHERE "licencas"."id" = 1  [["instalacoes", 1], ["updated_at", "2014-09-21 19:11:01.339958"]]

  def checkout

    @licenca = Licenca.new(params.require(:licenca).permit!)
    @licenca.situacao_licenca = SituacaoLicenca.obter_aguardando_pagamento
    @licenca.preco = 20
    @licenca.instalacoes = 0
    @licenca.save!
---
INSERT INTO "licencas" ("created_at", "email", "nome", "situacao_licenca_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-09-21 16:31:13.282365"], ["email", "kelvio.matias@gmail.com"], ["nome", "Kelvio Silva"], ["situacao_licenca_id", 1], ["updated_at", "2014-09-21 16:31:13.282365"]]